Revit 2027 API
Application.NewAreaCreationData Method
Creates an object which wraps the arguments of Area for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaCreationData NewAreaCreationData(
	ViewPlan areaView,
	UV point
)
Public Function NewAreaCreationData (
	areaView As ViewPlan,
	point As UV
) As AreaCreationData
public:
AreaCreationData^ NewAreaCreationData(
	ViewPlan^ areaView,
	UV^ point
)
member NewAreaCreationData :
        areaView : ViewPlan *
        point : UV -> AreaCreationData
Parameters
areaView ViewPlan
The view of area element.
point UV
A point which lies in an enclosed region of area boundary where the new area will reside.
Return Value
AreaCreationData
The object containing the data needed for area creation.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace